// objects.js
// Реализуйте и экспортируйте по умолчанию функцию, которая возвращает ассоциативный массив, соответствующий JSON из файла example.json в этом упражнении. Всё, что вам нужно сделать — посмотреть на содержимое example.json и руками сформировать объект аналогичной структуры.
//
//     Подсказки
// Обратите внимание на сходство JSON и объекта. Оно не случайно. JSON является представлением объекта в текстовом виде.
//

// @ts-check

// BEGIN (write your solution here)
const object = () => {
    return {files: ["src/objects.js"], config: true}
};

export default object;
// END
